{
    "how to upload a notice": "As an admin, go to the Admin Panel and click 'Upload Notice'. You can attach a PDF or image, and provide a title and summary.",
    "how to register": "From the login page, enter a 4-digit unique ID, your name, and a password to register as a new user.",
    "how to login": "On the login screen, type your unique ID and password to log in to your account.",
    "how to edit profile": "Click 'Edit Profile' on the NoticeBoard or Admin Panel. You can change your name, password, or profile picture.",
    "how to logout": "Click the 🔙 Logout button at the top right to safely sign out.",
    "how to view notices": "After login, go to the Notice Board to view all the recent uploaded notices.",
    "how to download a notice": "If a notice has a file, click the ⬇️ Download button next to it to open or save it.",
    "how to use dark mode": "Click the 🌙 or ☀️ button to toggle between dark and light themes for your interface.",
    "how to use voice input": "In the DigiBot help section, click 🎤 to ask your question out loud instead of typing.",
    "how to use the chatbot": "Click ❓ Help to open DigiBot. You can ask any question via text or voice.",
    "can i use voice and text together": "Yes, DigiBot accepts both text and voice input. Use whichever you prefer.",
    "how to summarize a notice file": "When uploading a PDF or image, DigiNotice will automatically extract and summarize its content.",
    "can i upload an image notice": "Yes, admins can upload image notices (.jpg or .png) and the bot will extract text from it using OCR.",
    "how to upload a pdf": "PDF files can be uploaded through the Admin Panel → 'Upload Notice'. Summaries are auto-generated.",
    "how do notice summaries work": "Summaries appear at the bottom of the NoticeBoard. They auto-rotate every few seconds.",
    "can the chatbot learn new questions": "Yes. If DigiBot doesn't know the answer, it stores the question for admin training.",
    "what happens to unknown questions": "Unrecognized queries are stored in a file. Admins can train DigiBot with answers using TrainBot.",
    "how does the admin train the bot": "Open TrainBot to review unknown questions and enter the correct answers. This updates the bot's brain.",
    "how to update password": "In 'Edit Profile', type your new password and click 'Update Profile'. Make sure it’s strong!",
    "how to change name": "Just go to 'Edit Profile', type your new name, and save changes.",
    "how to change profile picture": "In the 'Edit Profile' page, click 📸 to upload a new image as your profile picture.",
    "who is the admin": "The user with Unique ID '0001' is the system administrator and can manage all notices and users.",
    "can students upload notices": "No. Only the admin has access to upload notices to the system.",
    "can i delete my account": "At the moment, users cannot delete their accounts themselves. Please contact the admin.",
    "what file types are supported": "You can upload PDF and image files (.png, .jpg, .jpeg) as notices.",
    "how many notices are shown": "Currently, the latest 3 notices are shown on the board along with their download options.",
    "where is the notice summary": "Summaries are shown in a scrolling section below the main notice list.",
    "how often do summaries change": "Summaries are auto-rotated every 5 seconds with a fade animation.",
    "is diginotice available on mobile": "No, DigiNotice is a desktop application built with PyQt5.",
    "what happens when i click help": "Clicking ❓ Help opens DigiBot, your virtual assistant for the DigiNotice platform.",
    "can i ask multiple questions": "Yes, you can keep asking DigiBot as many questions as you want during the session.",
    "what if the chatbot gives no answer": "That question is stored for admin training. Next time you ask, it might know the answer!",
    "can i update my notice": "Currently, notices cannot be updated once posted. Admins may delete and re-upload if needed.",
    "can i see previous summaries": "Summaries rotate automatically. Only recent summaries are available in the scrolling view.",
    "how is my data stored": "Your profile information and notices are securely stored in the database managed by DigiNotice.",
    "what if my voice is not detected": "Check your microphone and internet connection, then try speaking again. Background noise may affect accuracy.",
    "how does diginotice extract text": "PDFs are processed using text readers, and images use OCR to extract readable content for summarization.",
    "how does the chatbot work": "It looks up your question in a stored JSON brain. If unknown, it logs it for future training.",
    "how do admins train the chatbot": "By running TrainBot, admins answer unknown questions which are then saved to the brain.json file.",
    "how to change my name": "Go to edit profile and change it",
    "logout": "Click on logout button"
}